In [2]:
import pandas as pd
import numpy as np
import copy 

ds = pd.read_csv('../originaldata/8_PODKARPACKIE.csv')

   Unnamed: 0  Dni od zakupu  Marka  Wiek kupującego Płeć kupującego  Ocena
0           0              8  Tefal              NaN             bd.    1.5
1           1              6  Tefal             39.0             bd.    1.0
2           2              5  Dyson             35.0             bd.    1.5
3           3              8  Dyson             43.0             bd.    1.5
4           4              8   Beko              NaN             bd.    2.5

In [6]:
# Głęboka kopia oryginalnych danych
ds_clear = copy.deepcopy(ds)

# Mapowanie opisu 'bd.' na wartość None, wyświetlenie wyniku
ds_clear['Płeć kupującego'] = ds_clear['Płeć kupującego'].map({'bd.': None, 'K': 'K', 'M': 'M'})
ds_clear.head(5)

   Unnamed: 0  Dni od zakupu  Marka  Wiek kupującego Płeć kupującego  Ocena
0           0              8  Tefal              NaN            None    1.5
1           1              6  Tefal             39.0            None    1.0
2           2              5  Dyson             35.0            None    1.5
3           3              8  Dyson             43.0            None    1.5
4           4              8   Beko              NaN            None    2.5

In [7]:
# Zapis do nowego pliku csv
ds_clear.to_csv(path_or_buf='../analisysdata/podkarpackie_clean.csv', index=False)